[
  {
    "image": "/podcast.jpg",
    "title": "Ethics",
    "duration": "TBD",
    "host": "Ellice Nelson",
    "guest": "Dr Cian O'Reilly",
    "description": "Ethics blah blah",
    "colorTheme": "yellow",
    "credits": "Darragh Luby, Naem Haq, Mia Borko, Jack Casey, Jean Carson, Kelly Abidoye",
    "references": [],
    "gameContent": {
      "type": "ethical-dilemmas",
      "about": "Test your ethical decision-making with real-world scenarios",
      "howToPlay":{
        "steps": [
          "Read each scenario carefully",
          "Choose the option that results in the most ethical outcome",
          "Receive feedback on your choice and see how others responded",
          "If you less people agree with your choice, you are not wrong but the other option is preferable in that situation"
        ]
      },
      "scenarios": [
        {
          "id": 1,
          "title": "The Resume Parser (AI bias) \n",
          "description": "Your startup's AI resume screener works great, but you discover it's 40% less likely to advance resumes with non-Western names. The fix would delay launch by 3 months.",
          "options": [
            {
              "text": "Ship now with a disclaimer about potential bias",
              "feedback": "You can launch faster, but this option carries significant legal/PR risks because the bias still affects applicants (53% agree)",
              "correct": false
            },
            {
              "text": "Delay and fix the bias issue first",
              "feedback": "Good choice! While this option results in a delayed launch, you avoid discrimination fallout and ship something defensible and ethical (47% agree)",
              "correct": true
            }
          ]
        },
        {
          "id": 2,
          "title": "The Engagement Feature (Engagement vs. Fairness)\n",
          "description": "The product team wants you to implement 'streak notifications' to encourage users to continue using the app when they break their usage streak (like Duolingo).",
          "options": [
            {
              "text": "Refuse and propose time-limit features instead",
              "feedback": "You might lose easy engagement benefits, but you're being considerate and virtuous! It's always better to protect users through non-manipulative engagement features rather than exploiting their loss aversion (62% agree)",
              "correct": true
            },
            {
              "text": "Implement with an easy opt-out buried in settings",
              "feedback": "This will definitely boost engagement, but it's quite manipulative; hiding the opt-out option is a snaky move 🐍 (38% agree)",
              "correct": false
            }
          ]
        },
        {
          "id": 3,
          "title": "The Nudge (Sales/Engagement vs. Transparency)\n",
          "description": "Your food delivery app can either show restaurant fees upfront (reducing orders by 20%) or reveal them at checkout.",
          "options": [
            {
              "text": "Hide until checkout because it's an industry standard",
              "feedback": "This will likely lead to more orders being placed (people don't want to delete the order they spent so much time creating), and it follows industry norms, but it's misleading, and I know you'd prefer to know upfront (45% agree)",
              "correct": false
            },
            {
              "text": "Show upfront for transparency",
              "feedback": "Even if orders drop slightly, prioritising trust and transparency is always better! Users appreciate this and might even lead to greater adoption via good reviews (55% agree)",
              "correct": true
            }
          ]
        },
        {
          "id": 4,
          "title": "The Cookie Banner (UX Dark Patterns)\n",
          "description": "The legal team has approved your European cookie consent banner, which makes 'Accept All' a big green button, while 'Reject' requires three clicks through nested menus.",
          "options": [
            {
              "text": "Ship it, it's legal!",
              "feedback": "Yes, it's legal, but it's a dark pattern and obviously nudges people into accepting (you deviant). Always consider how these things would impact YOU instead of turning a blind eye (58% agree)",
              "correct": false
            },
            {
              "text": "Make both options equally accessible",
              "feedback": "Wise decision! You might lose ad revenue and analytical insights, but this approach allows you to be genuine and transparent. It's always important to prioritise your users' preferences and privacy concerns (42% agree)",
              "correct": true
            }
          ]
        },
        {
          "id": 5,
          "title": "The Metrics Game (Engagement vs. Safety)\n",
          "description": "Your recommendation algorithm maximises 'time on platform' perfectly, but you notice it consistently surfaces rage-bait and conspiracy content.",
          "options": [
            {
              "text": "Retrain for 'quality interactions' even if engagement drops",
              "feedback": "You sacrifice that easy engagement win, but reducing harm and maintaining better quality content is the right choice (in our opinion) (67% agree)",
              "correct": true
            },
            {
              "text": "Keep it! Engagement metrics are up 40% 😎",
              "feedback": "Everyone wants better engagement, which is understandable, but it also spreads harmful content and overlooks user safety (33% agree)",
              "correct": false
            }
          ]
        },
        {
          "id": 6,
          "title": "The Accessibility Dilemma (Accessibility – Inclusivity vs. Effort) \n",
          "description": "Your banking app works perfectly fine for the vast majority of users, but screen readers can't parse the custom UI components. Fixing it means rebuilding 30% of the frontend. Only 0.3% of users need screen readers.",
          "options": [
            {
              "text": "Rebuild the components to be fully accessible",
              "feedback": "Making the interface fully accessible means you value all of your users equally. It might cost more or take a bit longer, but it's essential to be inclusive and supportive (46% agree)",
              "correct": true
            },
            {
              "text": "Add a basic text-only version for accessibility",
              "feedback": "This is cheaper and is easy to implement. While it covers basic functionality, it's reducing the quality of your app for a small subset of users and isn't true accessibility (54% agree)",
              "correct": false
            }
          ]
        },
        {
          "id": 7,
          "title": "The License Violation (Intellectual Property – Licensing)\n",
          "description": "You find perfect GPL-licensed code for a critical feature, but your company refuses to open-source their product (as per the license). Your manager says, 'Just change variable names'.",
          "options": [
            {
              "text": "Write custom equivalent code from scratch (pushes feature release by 3 days)",
              "feedback": "Your feature might take a little longer to ship, but this choice keeps you out of trouble and avoids legal consequences (59% agree)",
              "correct": true
            },
            {
              "text": "Use it! Nobody will know",
              "feedback": "You ship the important feature quickly, but this is a clear GPL violation and has a huge legal risk. Renaming variables might make it less obvious, but it's always better to be safe and comply with software licenses! (41% agree)",
              "correct": false
            }
          ]
        },
        {
          "id": 8,
          "title": "The FOSS Maintainer (FOSS vs. 🤑)\n",
          "description": "AWS is making millions from your open-source database while you work weekends to fix bugs for free.",
          "options": [
            {
              "text": "Switch to the SSPL license to force payment",
              "feedback": "YES! We hate big tech – they should pay! Unfortunately, this might reduce adoption and does not truly qualify as FOSS according to the Open Source Initiative (OSI) (65% agree)",
              "correct": true
            },
            {
              "text": "Keep it MIT, and maintain the true FOSS spirit",
              "feedback": "You're a true FOSS OG, even if that means letting companies profit off your work without contribution 😒 (35% agree)",
              "correct": false
            }
          ]
        },
        {
          "id": 9,
          "title": "The Dependency (FOSS Ethics)\n",
          "description": "A popular FOSS library you maintain is being used by defence contractors for drone targeting systems.",
          "options": [
            {
              "text": "Add ethical use restrictions to the license",
              "feedback": "Attempting to steer usage away from harmful applications is admirable and righteous, but it technically goes against standard FOSS principles. It's definitely a grey area! (62% agree)",
              "correct": true
            },
            {
              "text": "Keep it truly open source, it's not your responsibility",
              "feedback": "You're sticking to open-source philosophy, but you have no control over how people will use your software (38% agree)",
              "correct": false
            }
          ]
        },
        {
          "id": 10,
          "title": "The Whistleblower (Unethical / Illegal Industry Practices)",
          "description": "You discover your encrypted messaging app has a government backdoor. Your manager says, 'Don't tell anyone, we need this under wraps.' Revealing it would violate your NDA and potentially lead to your termination.",
          "options": [
            {
              "text": "Stay quiet and do what your manager says",
              "feedback": "You're protecting your job and following your manager's orders, but you are still leaving users exposed and ignoring your manager's unethical behaviour! (41% agree)",
              "correct": false
            },
            {
              "text": "Go against your manager and report internally through proper channels",
              "feedback": "We think this is the right move. By formally reporting the issue and raising your manager's misconduct, you avoid legal risk, but you may still face retaliation (48% agree)",
              "correct": true
            }
          ]
        }
      ]
    }
  },
  {
    "image": "/Economics.jpg",
    "title": "Economics",
    "duration": "TBD",
    "host": "Ellice Nelson",
    "guest": "Ushen Wijayaratne",
    "description": "This podcast explores how economic forces shape the tech industry, from why tech salaries swing widely to the demand and supply of the Irish tech market. We demystify the AI bubble and what happens if the bubble pops. ",
    "colorTheme": "pink",
    "credits": "Daniel Moody, Justyna Przyborska, Jack Casey, Jean Carson, Kelly Abidoye",
    "references": [
      "Bailyn, E. (2024) 'How to Value & Sell a SaaS Company', <i>First Page Sage</i>, available: https://firstpagesage.com/business/how-to-value-and-sell-a-saas-company/ [accessed 4 Nov 2025].",
      "Economics Defined With Types, Indicators, and Systems [online] (2025) <i>Investopedia</i>, available: https://www.Investopedia.com/terms/e/economics.asp [accessed 26 Nov 2025].",
      "Foreign Direct Investment [online] (2025) available: https://enterprise.gov.ie/en/what-we-do/trade-investment/foreign-direct-investment-fdi-/fdi.html [accessed 26 Nov 2025].",
      "Gu, J. and Metz, C. (2025) 'How OpenAI Uses Complex and Circular Deals to Fuel Its Multibillion-Dollar Rise', <i>The New York Times</i>, 31 Oct, available: https://www.nytimes.com/interactive/2025/10/31/technology/openai-fundraising-deals.html [accessed 4 Nov 2025].",
      "How Do Interest Rates Affect the Stock Market? [online] (2025) <i>Investopedia</i>, available: https://www.Investopedia.com/investing/how-interest-rates-affect-stock-market/ [accessed 4 Nov 2025].",
      "Irish Examiner (2021) Dublin Secures a Brexit Win as City of London Hit Worse than Expected [online], available: https://www.irishexaminer.com/business/economy/arid-40268009.html [accessed 26 Nov 2025].",
      "Jeremy Kahn (2025) Nvidia's $100 Billion OpenAI Investment Raises Eyebrows and a Key Question: How Much of the AI Boom Is Just Nvidia's Cash Being Recycled? [online], Yahoo Finance, available: https://finance.yahoo.com/news/nvidia-100-billion-openai-investment-110000256.html [accessed 4 Nov 2025].",
      "Landymore, F. (2025) 'The Amount of Money OpenAI Lost Last Quarter Will Make You Choke on Your Slurpee',<i>Futurism</i>, available: https://futurism.com/artificial-intelligence/openai-money-lost-quarter [accessed 4 Nov 2025].",
      "Microeconomics vs. Macroeconomics: Key Differences Explained [online] (2025) <i>Investopedia</i>, available: https://www.Investopedia.com/ask/answers/difference-between-microeconomics-and-macroeconomics/ [accessed 26 Nov 2025].",
      "Network Effects: Creating Tech Equity Value [online] (2025) <i>Morgan Stanley</i>, available: https://www.morganstanley.com/ideas/network-effects-global-tech-equity-value [accessed 4 Nov 2025].",
      "Obed, D.E. (2025) 'The $1.7 Trillion Paradox: How Amazon Turned 20 Years of Losses Into the Ultimate Victory', <i>Medium</i>, available: https://medium.com/@ehoneahobed/the-1-7-trillion-paradox-how-amazon-turned-20-years-of-losses-into-the-ultimate-victory-78a6ca26dc3d [accessed 4 Nov 2025].",
      "OnlyCFO (2025) Snowflake's Fall to Earth 📉 [online], available: https://www.onlycfo.io/p/snowflakes-fall-to-earth [accessed 26 Nov 2025].",
      "Report 2025: Bridging Ireland's Tech Skills Gap through Social Mobility | Generation Ireland [online] (2025) available: https://ireland.generation.org/news/report-2025-bridging-irelands-tech-skills-gap-through-social-mobility/ [accessed 26 Nov 2025].",
      "<i>The State of the AI Industry Is Freaking Me Out</i> [online] (2025) available: https://www.youtube.com/watch?v=Q0TpWitfxPk [accessed 4 Nov 2025].",
      "What Is Series Funding A, B, and C? [online] (2025) <i>Investopedia</i>, available: https://www.Investopedia.com/articles/personal-finance/102015/series-b-c-funding-what-it-all-means-and-how-it-works.asp [accessed 4 Nov 2025]."
    ],
     "gameContent": {
      "type": "crossword",
      "about": "Test your economics knowledge with this interactive crossword puzzle",
      "howToPlay": {
        "steps": [
          "Click on a clue to highlight the corresponding word",
          "Type your answer directly into the crossword grid",
          "Use the 'Check' button to verify your answers",
          "Stuck? Use the 'Reveal' button for hints"
        ]
      },
      "url": "https://crosswordlabs.com/embed/2025-11-24-234"
    }
  },
  {
    "image": "/podcast.jpg",
    "title": "Legal",
    "duration": "TBD",
    "host": "Ellice Nelson",
    "guest": "Violet Browne",
    "description": "Legal blah blah",
    "colorTheme": "green",
    "credits": "Ruan O' Dowd, Michelle Vaz, Jack Casey, Jean Carson, Kelly Abidoye",
    "references": []
  },
  {
    "image": "/podcast.jpg",
    "title": "Contracts and Founders",
    "duration": "TBD",
    "host": "Ellice Nelson",
    "guest": "Alisia Kazimierek, JJ Olajitan",
    "description": "Negotiation is normal” — and in this episode, we prove it. Learn how to protect your equity, your contracts, and your sanity whether you’re building a company or joining one.",
    "colorTheme": "blue",
    "credits": "Dawid Jakubowski, Nandakishore Vinayakrishnan, Jack Casey, Jean Carson, Kelly Abidoye",
    "references": [  ]
  }
]
